CSI API ETABS v1
cDConcSlabACI318_19.GetPreference Method
 Retrieves the value of a concrete slab design preference item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref string textValue,
	ref double numericValue
)
Function GetPreference (
	Item As Integer,
	ByRef textValue As String,
	ByRef numericValue As Double
) As Integer
Dim instance As cDConcSlabACI318_19
Dim Item As Integer
Dim textValue As String
Dim numericValue As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	textValue, numericValue)
int GetPreference(
	int Item,
	String^% textValue,
	double% numericValue
)
abstract GetPreference :
        Item : int *
        textValue : string byref *
        numericValue : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 21, inclusive, indicating the preference item considered
The resistance factor Phi (tension controlled)
The resistance factor Phi (compression controlled)
The resistance factor Phi (shear)
The clear cover for the top non-prestressed reinforcement [L]
The clear cover for the bottom non-prestressed reinforcement [L]
The name of the reinforcement bar that is the preferred rebar for non-prestressed reinforcement
This is either A or B indicating the design strip layer that represents the inner slab rebar layer
The top CGS of the tendon [L]
The bottom CGS of the tendon in exterior bays [L]
The bottom CGS of the tendon in interior bays [L]
This is either One Way or Two Way indicating the slab type assumed when calculating the required minimum reinforcing for the slab
Indicates if the allowable PT stresses are user defined
The concrete strength ratio at transfer used when calculating initial stresses
The top fiber tensile stress ratio used when calculating initial stresses
The bottom fiber tensile stress ratio used when calculating initial stresses
The extreme fiber compressive stress ratio used when calculating initial stresses
The top fiber tensile stress ratio used when calculating final stresses
The bottom fiber tensile stress ratio used when calculating final stresses
The extreme fiber compressive stress ratio used when calculating final stresses
The extreme fiber compressive stress ratio used when calculating sustained stresses
The fraction of live load considered used when calculating sustained stresses
textValue
Type: System.String
 If the indicated Item is a text value, this argument will be filled, and numericValue should be ignored
numericValue
Type: System.Double
 If the indicated Item is a number, this argument will be filled, and textValue will be blank
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value
See Also
Reference
cDConcSlabACI318_19 Interface
ETABSv1 Namespace